Autodesk.Revit.DB.FilledRegionType.BackgroundPatternId
The background fill pattern Id.
Remarks:
The FillPattern used for a background pattern must have a 'Drafting' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.FilledRegionType.ForegroundPatternId
The foreground fill pattern Id.
Remarks:
When the FilledRegionAttributes element is in a family then
the FillPattern used for a foreground pattern must have a 'Drafting' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019